"""
# Задание 1
При построении системы аутентификации Шнорра были выбраны параметры системы $t$, $p$, $q$. Завершить построение системы, выбрав при этом наименьшее подходящее натуральное значение $g$. По данному закрытому ключу $x$ вычислить открытый ключ $y$ у пользователя А.
$$t=4, p=59, q=29, x=18;$$
$$t=5, p=83, q=41, x_1=21, x_2=16;$$
$$t=4, p=103, q=17, x_1=14, x_2=11.$$
"""

from typing import Generator

from sage.all import *


def preparing_y(t: int, p: int, q: int, x: int) -> tuple[int, int]:
    """Построение системы по известным параметрам `t`, `p`, `q` и закрытом ключу `x`

    Аргументы:
        t (int): параметр безопасности
        p (int): простое число
        q (int): простое число, `q >= 2^t`
        x (int): закрытый ключ

    Возвращает:
        tuple[int, int]: `g`, `y`
    """
    alpha = primitive_root(p)  # Первообразный корень по модулю p
    g = pow(alpha, (p - 1) / q, p)

    y = var("y")  # Открытый ключ пользователя А
    y = solve_mod(y * pow(g, x) == 1, p)[0][0]

    return g, y


def get_schnorr_scheme() -> Generator[int, None, None]:
    """Получение параметров построенных систем

    Yields:
        Generator[int, None, None]: `t`, `p`, `q`, `g`, `x`, `y`
    """
    for d in data:
        if len(d) == 4:
            t, p, q, x = d
        elif len(d) == 5:
            t, p, q, x, _ = d
        g, y = preparing_y(t, p, q, x)
        yield t, p, q, g, x, y


# Наборы данных (t, p, q, x)
data = [
    [3, 23, 11, 5],  # Пример со страницы 8
    [4, 59, 29, 18],
    [5, 83, 41, 21, 16],
    [4, 103, 17, 14, 11],
]


if __name__ == "__main__":
    for d in data:
        if len(d) == 4:
            t, p, q, x = d
            g, y = preparing_y(t, p, q, x)
            print(f"Параметры системы: {t = }, {p = }, {q = }, {x = }")
            print(
                f"Завершенная система. Значение {g = }, открытый ключ пользователя А: {y = }\n"
            )
        elif len(d) == 5:
            t, p, q, x_1, x_2 = d
            g, y_1 = preparing_y(t, p, q, x_1)
            g, y_2 = preparing_y(t, p, q, x_2)
            print(f"Параметры системы: {t = }, {p = }, {q = }, {x_1 = }, {x_2 = }")
            print(
                f"Завершенная система. Значение {g = }, "
                f"открытый ключ пользователя А1: {y_1 = }, "
                f"открытый ключ пользователя А2: {y_2 = }\n"
            )
